# SetTaperedComponent

## Description
Sets the tapered component of the object.

```pascal
PROCEDURE SetTaperedComponent(
				object         : HANDLE;
				componentIndex : INTEGER);
```

```python
def vs.SetTaperedComponent(object, componentIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a slab, Slab Style, or the Slab Preferences.|
|componentIndex|INTEGER|The index of the component.|

## See Also
VS Functions:
GetTaperedComponent

## Version
Availability: from Vectorworks 2017

## Category
* Objects - Architectural